import { WelcomeBox, Title, DescrTxt, List } from './WelcomeText.styled';

export const WelcomeText = () => {
  return (
    <WelcomeBox className="greeting-text">
      <Title className="main-head">
        Ласкаво просимо на наш веб-портал для творчих душ!{' '}
      </Title>
      <DescrTxt className="descr-txt">
        Тут у вас є унікальна можливість поділитися своєю творчістю зі світом та
        знайти однодумців, які оцінять ваші старання.
      </DescrTxt>
      <DescrTxt className="descr-txt">
        Чи мрієте ви поділитися своєю музикою, авторськими піснями або чимось
        цілком новим? Наша платформа - ідеальне місце для вашої творчості.
        Завантажуйте свої роботи, діліться своїми історіями та досвідом, і
        отримуйте фідбек від нашої активної спільноти.
      </DescrTxt>
      <DescrTxt className="descr-txt">
        Але це не все! Ви також можете знайти та відгукнутися на цікаві
        оголошення, розміщені іншими учасниками: чи це пошук напарника для
        музичного проекту, чи вокаліста для вашої групи, чи можливість взяти
        участь у іншому проекті - у нас є розділ спеціально для цього.{' '}
      </DescrTxt>
      <DescrTxt className="descr-txt">На нашому сайті ви зможете:</DescrTxt>
      <List>
        <li>Виставити свою творчість на огляд спільноти.</li>
        <li>Знайти людей з аналогічними інтересами та почати співпрацю.</li>
        <li>
          Залишити відгук на оголошення та знайти потрібних вам партнерів.
        </li>
      </List>
      <DescrTxt className="descr-txt">
        Нехай ваша творчість займає центральне місце на нашому порталі!
        Приєднуйтеся до нашої спільноти та відкривайте для себе безмежний світ
        творчості та можливостей!
      </DescrTxt>
    </WelcomeBox>
  );
};
